test/artillery.io/load_testing.socket.access-ep.yaml
config:
  target: http://localhost:8081
  #  transports: [ "websocket" ]
  phases:
    - duration: 60
      arrivalRate: 10
      name: Basic
  engines:
    socketio-v3: { }
scenarios:
  - engine: socketio-v3
    flow:
      - emit:
          channel: 'access-endpoint'
          data: 'user.auth.register.start'
#          response:
#            channel: 'response'
#            data: '{"data":[{"id":1,"name":"Johnny","email":"A@bet","password":"1234543asdf","account":null,"phone":null}],"message":"Retrieved successfully"}'